[
    {
        "institution": "Harvard University Widener Library Judaica Division",
        "position": "Summer Student Programmer",
        "jobType": "Seasonal Full-Time",
        "img" : "harvlib.jpeg",
        "location": "Cambridge, MA",
        "dateRange": "May 2024 - Present",
        "description": "In my role as a Summer Student Programmer at Harvard University Widener Library Judaica Division, I have worked with Google Chrome extensions developed with web technologies to optimize the performance of library operations. I designed programs in Python and JavaScript to process inventories and generate reports. Additionally, I assisted library staff with various technical issues, ensuring smooth and efficient operations within the library."
    },
    {
        "institution": "Pronova Pets",
        "position": "Contract Machine Learning Engineer",
        "jobType": "Contract",
        "location": "Remote",
        "img" : "pron.jpeg",
        "dateRange": "Sep. 2023 - April 2024",
        "description": "As a Contract Machine Learning Engineer at Pronova Pets, I designed and implemented a full-stack mobile application that provided users with needed information. My role involved applying machine learning methods to datasets from cloud databases to make accurate predictions. This project required a deep understanding of both machine learning and full-stack development to deliver a robust and user-friendly application."
    },
    {
        "institution": "BlackRocket Productions",
        "position": "Summer Lead Instructor",
        "jobType": "Full-Time",
        "location": "Remote",
        "img" : "blar.jpeg",
        "dateRange": "07/2023 - 08/2023",
        "description": "As a Lead Instructor at BlackRocket Productions, I taught Computer Science courses to primary-level students, covering topics such as Python Programming, Web Development, and Game Development. I organized lecture materials for daily lessons, ensuring that each class was well-structured and engaging. Additionally, I managed necessary functions such as daily backups to ensure the security and continuity of our educational content."
    },
    {
        "institution": "Codespeaks Labs",
        "position": "Coding Coach",
        "jobType": "Part-Time",
        "location": "Remote",
        "img" : "codespeak.png",
        "dateRange": "1/16/2023 - 05/21/2023",
        "description": "I taught elementary-level students programming skills through different educational services such as Scratch.mit, and robotic kits such as Dash robotics and Makey-Makey kits. I was responsible for two different courses at two different schools, fostering a positive and engaging learning environment with pre-designed course material."
    },
    {
        "institution": "Seidenberg Creative Labs",
        "position": "Software Engineer",
        "jobType": "Part Time",
        "location": "New York, NY",
        "img" : "scl.png",
        "dateRange": "11/01/2021 - 5/20/2023",
        "description": "As a Software Engineer at Seidenberg Creative Labs, I engaged directly with clients to transform their ideas into digital solutions. I collaborated with a team of developers to design and develop prototypes for various projects. My role involved utilizing a wide range of technologies including React, JavaScript, HTML, Python, AWS, and Google APIs. I played a key part in both the frontend and backend development processes, ensuring that the solutions were not only functional but also scalable and user-friendly."
    },
    {
        "institution": "MIT Lincoln Laboratory",
        "position": "Summer Co-Lead Instructor",
        "jobType": "Seasonal Full-Time",
        "location": "Cambridge, MA",
        "img" : "bwsi.png",
        "dateRange": "05/05/2022 - 08/08/2022",
        "description": "I worked as a Co-Lead Instructor for one of the courses- Serious Games and Artificial Intelligence- which taught high school students artificial intelligence and programming through Reinforcement LearningMy role involved managing and facilitating the learning process, ensuring that students were able to create productive and innovative projects. I also contributed to the development of the curriculum, focusing on key areas of programming and artificial intelligence using Python and OpenAIGym."
    }
]
